stuartpittaway/diyBMSv4ESP32/STM32All-In-One/src/main.cpp
/*
____  ____  _  _  ____  __  __  ___
(  _ \(_  _)( \/ )(  _ \(  \/  )/ __)
)(_) )_)(_  \  /  ) _ < )    ( \__ \
(____/(____) (__) (____/(_/\/\_)(___/

DIYBMS V4

V490 UP TO 16S CELL MONITORING MODULES

STM32F030K6T6

(c)2023 Stuart Pittaway

COMPILE THIS CODE USING PLATFORM.IO

LICENSE
Attribution-NonCommercial-ShareAlike 2.0 UK: England & Wales (CC BY-NC-SA 2.0 UK)
https://creativecommons.org/licenses/by-nc-sa/2.0/uk/

* Non-Commercial — You may not use the material for commercial purposes.
* Attribution — You must give appropriate credit, provide a link to the license, and indicate if changes were made.
  You may do so in any reasonable manner, but not in any way that suggests the licensor endorses you or your use.
* ShareAlike — If you remix, transform, or build upon the material, you must distribute your
  contributions under the same license as the original.
* No additional restrictions — You may not apply legal terms or technological measures
  that legally restrict others from doing anything the license permits.
*/

#define RX_BUFFER_SIZE 64

#include <Arduino.h>

extern "C"
{
  void SystemClock_Config(void);
}

extern "C"
{
#include "stm32_flash.h"
}

#include "SPI.h"
#include <SerialEncoder.h>
#include "packet_processor.h"

// Our project code includes
#include "defines.h"
#include "cell.h"
#include <SerialEncoder.h>
#include "packet_processor.h"

#if !defined(HAL_UART_MODULE_ENABLED)
#error Expected HAL_UART_MODULE_ENABLED
#endif

// Two unused jumpers which could be used to enable features/comms address etc.
const auto ADDRESS0_JP3 = PA11;

const auto AFE_EN = PB0;
const auto RELAY = PB1;
const auto AFE_CS = PB5;
const auto ADC_CS_CNVST = PB6;
const auto SAMPLE_AFE = PB4;
const auto THERM_ENABLE = PA8;
const auto THERM_J11_T1 = PA_4;
const auto THERM_J12_T2 = PA_0;
const auto THERM_J13_T3 = PA_1;
const auto BALANCE_DETECT = PA12;
const auto FAN = PB3;

// Prototype functions...
[[noreturn]] void ErrorFlashes(int number);
uint32_t takeRawMCP33151ADCReading();
uint32_t MAX14921Command(uint8_t b1, uint8_t b2, uint8_t b3);
void DecimateRawADCCellVoltage(std::array<uint32_t, 16> &rawADC, CellData &cd, uint8_t numberCells);
void TakeExternalTempMeasurements(CellData &cd);
uint16_t DecimateValue(uint64_t val);
void EnableThermistorPower();
void DisableThermistorPower();
int16_t ReadThermistor(uint32_t);
int16_t ReadTH();
uint32_t MAX14921Command(uint16_t b1_2, uint8_t b3);
uint16_t CalculateCellBalanceRequirement(CellData &cd, uint8_t number_of_active_cells);

uint32_t fan_timer = 0;
uint32_t relay_timer = 0;

/// @brief Global variable to delay balance function on first power up
uint8_t waitbeforebalance = 20;

/// @brief Global variable to hold cell level data as its collected
CellData celldata{};

/// @brief Number of cells actually in use by the MAX chip (between 4 and 16)
uint8_t number_of_active_cells = 0;

uint8_t SerialPacketReceiveBuffer[8 + sizeof(PacketStruct)];

/// @brief Serial encoder
SerialEncoder myPacketSerial;

PacketProcessor PP;

/// @brief  Bitmap of which cells are balancing (maps into MAX chip register)
uint16_t cell_balancing = 0;

/// @brief   Is serial baud rate scanning active?
bool serialBaudScanning = true;
/// @brief  Index to current SerialBaudRates array
int8_t serialBaudIndex = 0;
/// @brief  Wait X iterations of loop() before swapping baud rates
int8_t serialBaudCountDown = 15;

// Baud rates that we can use
constexpr std::array<uint16_t, 4> SerialBaudRates = {10000, 9600, 5000, 2400};

const uint32_t LEVEL_SHIFTING_DELAY_MAX = 50; // μs
const uint32_t T_SETTLING_TIME_MAX = 10;      // μs

// Command byte 1
#define AFE_CB1 bit(7)
#define AFE_CB2 bit(6)
#define AFE_CB3 bit(5)
#define AFE_CB4 bit(4)
#define AFE_CB5 bit(3)
#define AFE_CB6 bit(2)
#define AFE_CB7 bit(1)
#define AFE_CB8 bit(0)

// Command byte 2
#define AFE_CB9 bit(7)
#define AFE_CB10 bit(6)
#define AFE_CB11 bit(5)
#define AFE_CB12 bit(4)
#define AFE_CB13 bit(3)
#define AFE_CB14 bit(2)
#define AFE_CB15 bit(1)
#define AFE_CB16 bit(0)
// Command byte 3
//  Enable Cell Selection
#define AFE_ECS bit(7)
// Selects the cell for voltage readout during hold phase
#define AFE_SC0 bit(6)
#define AFE_SC1 bit(5)
#define AFE_SC2 bit(4)
#define AFE_SC3 bit(3)
// 0: Device in sample phase if SAMPL input is logic-high, 1: Device in hold phase
// Not used by this code - using SAMPLE pin instead
#define AFE_SMPLB bit(2)
// Diagnostic enable (normally zero)
#define AFE_DIAG bit(1)
// Low-power mode enabled (normally zero)
#define AFE_LOPW bit(0)

#define BUFFER_CALIBRATION AFE_SC0

#define ANALOG_BUFFERED_T1 AFE_SC0 | AFE_SC2 | AFE_SC3
#define ANALOG_BUFFERED_T2 AFE_SC1 | AFE_SC2 | AFE_SC3
#define ANALOG_BUFFERED_T3 AFE_SC0 | AFE_SC1 | AFE_SC2 | AFE_SC3

#define ANALOG_CELL1 0
#define ANALOG_CELL2 AFE_SC0
#define ANALOG_CELL3 AFE_SC1
#define ANALOG_CELL4 AFE_SC0 | AFE_SC1
#define ANALOG_CELL5 AFE_SC2
#define ANALOG_CELL6 AFE_SC0 | AFE_SC2
#define ANALOG_CELL7 AFE_SC1 | AFE_SC2
#define ANALOG_CELL8 AFE_SC0 | AFE_SC1 | AFE_SC2
#define ANALOG_CELL9 AFE_SC3
#define ANALOG_CELL10 AFE_SC0 | AFE_SC3
#define ANALOG_CELL11 AFE_SC1 | AFE_SC3
#define ANALOG_CELL12 AFE_SC0 | AFE_SC1 | AFE_SC3
#define ANALOG_CELL13 AFE_SC2 | AFE_SC3
#define ANALOG_CELL14 AFE_SC0 | AFE_SC2 | AFE_SC3
#define ANALOG_CELL15 AFE_SC1 | AFE_SC2 | AFE_SC3
#define ANALOG_CELL16 AFE_SC0 | AFE_SC1 | AFE_SC2 | AFE_SC3

constexpr std::array<uint8_t, 16> CellTable =
    {
        AFE_ECS | ANALOG_CELL1,
        AFE_ECS | ANALOG_CELL2,
        AFE_ECS | ANALOG_CELL3,
        AFE_ECS | ANALOG_CELL4,
        AFE_ECS | ANALOG_CELL5,
        AFE_ECS | ANALOG_CELL6,
        AFE_ECS | ANALOG_CELL7,
        AFE_ECS | ANALOG_CELL8,
        AFE_ECS | ANALOG_CELL9,
        AFE_ECS | ANALOG_CELL10,
        AFE_ECS | ANALOG_CELL11,
        AFE_ECS | ANALOG_CELL12,
        AFE_ECS | ANALOG_CELL13,
        AFE_ECS | ANALOG_CELL14,
        AFE_ECS | ANALOG_CELL15,
        AFE_ECS | ANALOG_CELL16};

extern "C"
{
  void SystemClock_Config(void)
  {
    RCC_OscInitTypeDef RCC_OscInitStruct = {};
    RCC_ClkInitTypeDef RCC_ClkInitStruct = {};
    RCC_PeriphCLKInitTypeDef PeriphClkInit = {};

    /* Initializes the RCC Oscillators according to the specified parameters in the RCC_OscInitTypeDef structure.  */
    RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
    RCC_OscInitStruct.HSEState = RCC_HSE_ON;
    RCC_OscInitStruct.PLL.PLLState = RCC_PLL_NONE;
    if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
    {
      Error_Handler();
    }

    /* Initializes the CPU, AHB and APB buses clocks  */
    RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_SYSCLK | RCC_CLOCKTYPE_PCLK1;
    RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_HSE;
    RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
    RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV1;

    if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_0) != HAL_OK)
    {
      Error_Handler();
    }
    PeriphClkInit.PeriphClockSelection = RCC_PERIPHCLK_USART1;
    PeriphClkInit.Usart1ClockSelection = RCC_USART1CLKSOURCE_PCLK1;
    if (HAL_RCCEx_PeriphCLKConfig(&PeriphClkInit) != HAL_OK)
    {
      Error_Handler();
    }

    /* Enables the Clock Security System */
    HAL_RCC_EnableCSS();
  }
}

