stuartpittaway/diyBMSv4ESP32/STM32All-In-One/src/main.cpp
uint32_t SPITransfer24(uint8_t byte1, uint8_t byte2, uint8_t byte3)
{
  uint32_t data;

  data = SPI.transfer(byte1);
  data <<= 8;

  data |= SPI.transfer(byte2);
  data <<= 8;

  data |= SPI.transfer(byte3);

  return data;
}

/// @brief Query MAX14921 chip (analog front end=AFE) and determine its ready status
/// @return number of connected battery cells (up to 16)
uint8_t queryAFE()
{
  uint8_t cellCount;
  uint8_t DeviceIsNotReady = 1;
  uint8_t countDown = 20;

  while (countDown > 0)
  {
    // MAX14921
    digitalWrite(SAMPLE_AFE, HIGH);              // Sample cell voltages (all 16 cells at same time)
    delay(60);                                   // Wait 60ms for capacitors to fill and equalize against cell voltages
    digitalWrite(SAMPLE_AFE, LOW);               // Disable sampling - HOLD mode
    delayMicroseconds(LEVEL_SHIFTING_DELAY_MAX); // Wait to settle

    // Tell AFE to switch AOUT channel to zero, all balancing off
    auto reply = MAX14921Command(0, 0, CellTable.at(0));

    // Bad reply - chip not enabled or connected?
    if (reply == 0)
    {
      ErrorFlashes(7);
    }

    DeviceIsNotReady = (reply & B00000010) >> 1;

    // Should be ZERO = MAX14921, 2= MAX14920
    // uint8_t productIdentifier = (reply & B11000000) >> 6;
    // uint8_t dieVersion = (reply & B00110000) >> 4;

    // 1: UV_VA = VA is below UV_VAVTH (4.7V)
    // VA (Analog Supply Voltage) below UV_VAVTH (4.7V)
    if (((reply & B00001000) >> 3) != 0)
    {
      ErrorFlashes(4);
    }
    // 1: VP is below UV_VPVTH (6V). If LOPW = 1, VP UVLO circuit is disabled and this bit is always set to 1
    if (((reply & B00000100) >> 2) != 0)
    {
      ErrorFlashes(5);
    }

    // thermal shutdown
    if ((reply & B00000001) != 0)
    {
      ErrorFlashes(2);
    }

    // Calculate how many cells are valid (based on reply from MAX chip)
    // Start with 16 cells
    cellCount = 16;
    uint16_t cells = (reply & 0x00FFFF00) >> 8;
    // Subtract 1 from cell count for each bit thats "1" (out of voltage range)
    // bit ="1" if under voltage of UV_VCVTH or over 5V
    while (cells)
    {
      cellCount -= cells & 1;
      cells >>= 1;
    }

    if (DeviceIsNotReady == 0)
    {
      // Everything is good - exit loop
      break;
    }

    // Loop again if needed until device is ready
    delay(250);
    countDown--;
  }

  // Device not ready after 5 seconds
  if (countDown == 0)
  {
    ErrorFlashes(6);
  }

  return cellCount;
}

/// @brief Loop through battery cells and take ADC measurement and store the raw (un-decimated) value in an array
/// @param cellCount number of cells to sample
/// @param rawADC array to hold output result
void ADCSampleCellVoltages(uint8_t cellCount, std::array<uint32_t, 16> &rawADC)
{
  // Scan active cell voltages (starting at highest)
  for (int8_t cellid = (cellCount - 1); cellid >= 0; cellid--)
  {
    MAX14921Command(0, CellTable.at(cellid));
    // Delay required for AOUT to settle
    delayMicroseconds(T_SETTLING_TIME_MAX);
    // Read cell voltage
    rawADC.at(cellid) = takeRawMCP33151ADCReading();
  }
}

/// @brief Calibrate internal op-amp buffer
void BufferAmplifierOffsetCalibration()
{
  // MAX14921
  digitalWrite(SAMPLE_AFE, HIGH); // Sample mode

  // Parasitic Capacitance Charge Injection Error Calibration
  MAX14921Command(0, BUFFER_CALIBRATION);

  // Takes 8ms to complete
  delay(8);
}

void NotificationLedOn()
{
  digitalWrite(PB7, HIGH);
}
void NotificationLedOff()
{
  digitalWrite(PB7, LOW);
}

void configureModules()
{
  CellModuleConfig config;

  // Default values for cells
  float Calibration = 1.0F;
  uint8_t BypassTemperatureSetPoint = 55;
  uint16_t BypassThresholdmV = 4250;
  uint16_t relay_range = 5;
  uint16_t relay_minimummv = 3400;
  int16_t fanswitchontemperature = BypassTemperatureSetPoint - 8;

  uint16_t RunAwayCellMinimumVoltage = 3400;
  uint16_t RunAwayCellDifferential = 75;

  flash_copy_buffer((uint8_t *)&config, sizeof(CellModuleConfig));
  // If we have a FLASH configuration, use that...
  if (config.magicnumber == 0x1234 && config.sizeofconfig == sizeof(CellModuleConfig))
  {
    Calibration = config.Calibration;
    BypassTemperatureSetPoint = config.BypassTemperatureSetPoint;
    BypassThresholdmV = config.BypassThresholdmV;
    relay_range = config.relay_range;
    relay_minimummv = config.relay_minimummv;
    fanswitchontemperature = config.fanswitchontemperature;
    RunAwayCellMinimumVoltage = config.RunAwayCellMinimumVoltage;
    RunAwayCellDifferential = config.RunAwayCellDifferential;
  }

  // These values are shared/static between cell instances
  Cell::setCalibration(Calibration);
  Cell::setBypassTemperatureSetPoint(BypassTemperatureSetPoint);
  Cell::setBypassThresholdmV(BypassThresholdmV);
  Cell::setRelayMinmV(relay_minimummv);
  Cell::setRelayRange(relay_range);
  Cell::setFanSwitchOnTemperature(fanswitchontemperature);

  PP.setRunAwayCellMinimumVoltage(RunAwayCellMinimumVoltage);
  PP.setRunAwayCellDifferential(RunAwayCellDifferential);

  // All cells excluding ZERO are prevented from having config changes made in this all-in-one board setup
  for (auto i = 1; i < celldata.size(); i++)
  {
    celldata.at(i).disableChanges();
  }
}

void onPacketReceived()
{
  // diyBMSHAL::EnableSerial0TX();

  // A data packet has just arrived, process it and forward the results to the
  // next module

  if (PP.onPacketReceived((PacketStruct *)SerialPacketReceiveBuffer, number_of_active_cells, celldata))
  {
    // Only light Notification if packet is good
    NotificationLedOn();
  }

  // Send the packet (fixed length!) (even if it was invalid so controller can count crc errors)
  myPacketSerial.sendBuffer(SerialPacketReceiveBuffer);

  Serial1.flush();

  NotificationLedOff();

  if (PP.getSettingsHaveChanged())
  {
    // We need to update the settings stored in FLASH
    // As this hardware pretends to be a 16S module - we copy all the settings from cell zero, everything else is ignored/wiped out

    // Save new values into flash - important to align this buffer "aligned(8)" for correct write into FLASH
    CellModuleConfig config __attribute__((aligned(8))) = {
        0x1234,
        sizeof(CellModuleConfig),
        Cell::getBypassTemperatureSetPoint(),
        Cell::getBypassThresholdmV(),
        Cell::getCalibration(),
        Cell::getRelayRange(),
        Cell::getRelayMinmV(),
        Cell::getFanSwitchOnTemperature(),
        PP.getRunAwayCellMinimumVoltage(),
        PP.getRunAwayCellDifferential()};

    // This function uses the top 1K of FLASH memory to emulate EEPROM
    flash_erase_and_write((uint8_t *)&config, sizeof(config));

    configureModules();

    PP.clearSettingsHaveChanged();
  }
}
void configurePins()
{
  // LED
  pinMode(PB7, OUTPUT);
  NotificationLedOn();

