stuartpittaway/diyBMSv4ESP32/STM32All-In-One/src/main.cpp
  pinMode(SAMPLE_AFE, OUTPUT);
  pinMode(AFE_CS, OUTPUT);
  pinMode(ADC_CS_CNVST, OUTPUT);
  pinMode(THERM_ENABLE, OUTPUT);
  pinMode(RELAY, OUTPUT);
  pinMode(ADDRESS0_JP3, INPUT_FLOATING);
  pinMode(AFE_EN, OUTPUT);
  pinMode(THERM_J11_T1, INPUT_ANALOG);
  pinMode(THERM_J12_T2, INPUT_ANALOG);
  pinMode(THERM_J13_T3, INPUT_ANALOG);
  pinMode(FAN, OUTPUT);

  // RELAY off
  digitalWrite(RELAY, LOW);
  // FAN off
  digitalWrite(FAN, LOW);
  digitalWrite(ADC_CS_CNVST, HIGH);
  digitalWrite(AFE_CS, HIGH);

  // Track cell voltages (LOW=HOLD SAMPLE)
  digitalWrite(SAMPLE_AFE, HIGH);

  // STM32 use 12 bit ADC resolution
  analogReadResolution(12);
  // STM32 default voltage reference (3.3v)
  analogReference(AR_DEFAULT);
}

void setup()
{
  SystemClock_Config();

  configurePins();
  DisableThermistorPower();

  // Check if balance board is fitted? (pin pulled up to 3.3v by daughter board)
  pinMode(BALANCE_DETECT, INPUT_PULLDOWN);
  PP.BalanceBoardInstalled = digitalRead(BALANCE_DETECT) == HIGH;
  // Disable pull down after checking
  pinMode(BALANCE_DETECT, INPUT_FLOATING);

  // Set up data handler
  Serial1.setTx(PA_9);
  Serial1.setRx(PA_10);
  // Start using the first serial baud rate (10k)
  Serial1.begin(SerialBaudRates.at(serialBaudIndex), SERIAL_8N1);
  myPacketSerial.begin(&Serial1, &onPacketReceived, sizeof(PacketStruct), SerialPacketReceiveBuffer, sizeof(SerialPacketReceiveBuffer));

  SPI.begin();

  // Restart MAX chip before we crack on...
  digitalWrite(AFE_EN, LOW);
  delay(100);
  digitalWrite(AFE_EN, HIGH);

  // Warm up ADC
  for (size_t i = 0; i < 128; i++)
  {
    takeRawMCP33151ADCReading();
  }

  // Sometimes on power up, the chip returns 1 cell more than actually connected, so take a few
  // samples and return the lowest cell count
  number_of_active_cells = 255;
  for (size_t i = 0; i < 4; i++)
  {
    auto x = queryAFE();

    if (x < number_of_active_cells)
    {
      number_of_active_cells = x;
    }
  }

  // We need at least 4 cells with correct voltages for this to work
  if (number_of_active_cells < 4)
  {
    ErrorFlashes(3);
  }

  BufferAmplifierOffsetCalibration();

  configureModules();

  NotificationLedOff();
}

uint32_t takeRawMCP33151ADCReading()
{
  /* ADC READING */
  // INPUT ACQUISITION PHASE (STANDBY), TOGGLE CONVERT START
  auto MCP33151settings = SPISettings(50000000, MSBFIRST, SPI_MODE0);

  // Take a reading and throw away - reset ADC accumulator to zero
  SPI.beginTransaction(MCP33151settings);
  digitalWrite(ADC_CS_CNVST, LOW);
  SPI.transfer(0xFF);
  SPI.transfer(0xFF);
  digitalWrite(ADC_CS_CNVST, HIGH);
  SPI.endTransaction();

  // Use MCP33151 Accumulator to over sample input voltage
  // Pulse CNVST for each sample we want to take and average
  // 256x over sample (last sample is taken by SPITransfer24 below)
  for (size_t i = 0; i < 256 - 1; i++)
  {
    digitalWrite(ADC_CS_CNVST, LOW);
    digitalWrite(ADC_CS_CNVST, HIGH);
    // This is probably not required...
    delayMicroseconds(1);
  }

  // Take a reading
  SPI.beginTransaction(MCP33151settings);
  // ADC conversion stops when CNVST goes LOW
  digitalWrite(ADC_CS_CNVST, LOW);
  auto val = SPITransfer24(0xFF, 0xFF, 0xFF);
  digitalWrite(ADC_CS_CNVST, HIGH);
  SPI.endTransaction();

  return val;
}

/// @brief Decimates an ADC reading after oversampling
/// @param val Takes in a raw ADC value which has been oversampled giving ENOB of 16.5-17 bits
/// @return Corrected value
uint16_t DecimateValue(uint64_t val)
{
  // decimate result by right shifting 2 places (raw ADC is 14 bits)
  val = val >> 2;
  // 4096 or 4500 voltage reference
  val = val * ((uint64_t)DIYBMSREFMILLIVOLT);
  // 4194304 = 2^22 effective resolution bits
  val = val / 4194304UL;

  return (uint16_t)val;
}

// Take the raw oversampled readings and decimate
void DecimateRawADCCellVoltage(std::array<uint32_t, 16> &rawADC, CellData &cells, uint8_t numberCells)
{
  for (int cellid = 0; cellid < numberCells; cellid++)
  {
    cells.at(cellid).setCellVoltage(DecimateValue(rawADC[cellid]));
  }
}

/// @brief Send a 24bit command to MAX14921 chip over SPI
/// @param b1_2 byte1 and 2 as uint16
/// @param b3 byte3
/// @return 24 bit answer
uint32_t MAX14921Command(uint16_t b1_2, uint8_t b3)
{
  uint8_t b1 = (b1_2 & 0xFF00) >> 8;
  uint8_t b2 = b1_2 & 0x00FF;
  return MAX14921Command(b1, b2, b3);
}

/// @brief Send a 24bit command to MAX14921 chip over SPI
/// @param b1 byte1
/// @param b2 byte2
/// @param b3 byte3
/// @return 24 bit answer
uint32_t MAX14921Command(uint8_t b1, uint8_t b2, uint8_t b3)
{
  // Tell AFE to switch AOUT channel to this cell for the ADC to measure
  const auto MAX14921SPISettings = SPISettings(40000000, MSBFIRST, SPI_MODE0);
  SPI.beginTransaction(MAX14921SPISettings);
  digitalWrite(AFE_CS, LOW);
  auto reply = SPITransfer24(b1, b2, b3);
  digitalWrite(AFE_CS, HIGH);
  SPI.endTransaction();
  return reply;
}

// NTC THERMISTOR CMFB103F3950FANT
// ADC MAPPING TO TEMPERATURE (DEGREES C)
constexpr std::array<int8_t, 256> thermistorTable =
    {
        -40, -40, -40, -40, -40, -40, -40, -40, -40, -39, -37, -36, -34, -33, -31, -30, -29,
        -28, -27, -26, -25, -24, -23, -22, -21, -20, -19, -19, -18, -17, -16, -16, -15, -14,
        -14, -13, -13, -12, -11, -11, -10, -10, -9, -9, -8, -8, -7, -6, -6, -5, -5, -4, -4,
        -4, -3, -3, -2, -2, -1, -1, 0, 0, 0, 1, 1, 2, 2, 3, 3, 3, 4, 4, 5, 5, 5, 6, 6, 7, 7,
        7, 8, 8, 8, 9, 9, 10, 10, 10, 11, 11, 11, 12, 12, 12, 13, 13, 14, 14, 14, 15, 15, 15,
        16, 16, 16, 17, 17, 17, 18, 18, 19, 19, 19, 20, 20, 20, 21, 21, 21, 22, 22, 22, 23, 23,
        24, 24, 24, 24, 25, 25, 26, 26, 26, 27, 27, 27, 28, 28, 28, 29, 29, 30, 30, 30, 31, 31,
        31, 32, 32, 33, 33, 33, 34, 34, 35, 35, 35, 36, 36, 37, 37, 37, 38, 38, 39, 39, 39, 40,
        40, 41, 41, 42, 42, 42, 43, 43, 44, 44, 45, 45, 46, 46, 47, 47, 48, 48, 49, 49, 50, 50,
        51, 51, 52, 52, 53, 54, 54, 55, 55, 56, 57, 57, 58, 59, 59, 60, 61, 61, 62, 63, 63, 64,
        65, 66, 67, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 80, 81, 82, 83, 85, 86, 88,
        89, 91, 93, 95, 97, 99, 101, 104, 107, 110, 113, 117, 120, 120, 120, 120, 120, 120, 120,
        120, 120, 120};

