stuartpittaway/diyBMSv4ESP32/STM32All-In-One/src/main.cpp
/// @brief Read external temperature sensors, connected to STM32 (12 bit ADC)
/// @return Temperature in celcius. A value of -999 means not-connected (shorted to ground)
int16_t ReadThermistor(uint32_t pin)
{
  auto value = (uint16_t)analogRead(pin);

  // Ignore extreme ranges - assume not connected
  if (value < 15 || value > 4000)
  {
    return (int16_t)-999;
  }

  // Scale 12 bit to 8 bit (TODO: we can probably just change the resolution of analogRead instead)
  auto byte_value = (uint8_t)map(value, 0, 4096, 0, 255);
  return thermistorTable.at(byte_value);
}

/// @brief Read external temperature sensors (connected to board J11/J12/J13 sockets)
/// @param cd Cell data array
void TakeExternalTempMeasurements(CellData &cd)
{
  // Set cell 0/1/2 to map to external temperature sensors (socket on pcb)
  cd.at(0).setExternalTemperature(ReadThermistor(THERM_J11_T1));
  cd.at(1).setExternalTemperature(ReadThermistor(THERM_J12_T2));
  cd.at(2).setExternalTemperature(ReadThermistor(THERM_J13_T3));
}

void EnableThermistorPower()
{
  digitalWrite(THERM_ENABLE, LOW);
}

void DisableThermistorPower()
{
  digitalWrite(THERM_ENABLE, HIGH);
}
/// @brief Read onboard thermistor sensor connected to the MCP33151
/// @return Celcius temperature reading
int16_t ReadTH()
{
  // 14 bit reply...
  auto value = DecimateValue(takeRawMCP33151ADCReading());
  // THx is connected to 3.3V max via 10K resistors - scale 3.3V to 4.096V reference
  // 3.600 is used as temperature appears to be over read by 2 celcius

  // Ignore extreme ranges - assume not connected
  if (value == 0)
  {
    return (int16_t)-999;
  }

  // Scale to 8 bit
  auto byte_value = (uint8_t)map(value, 0, long((3600.0F / ((float)DIYBMSREFMILLIVOLT)) * 4095.0F), 0, 255);
  return thermistorTable.at(byte_value);
}

/// @brief internal temperature sensors (on board)
/// @param cd Cell Data array
void TakeOnboardInternalTempMeasurements(CellData &cd)
{
  // internal temperature sensors on balance board
  if (PP.BalanceBoardInstalled)
  {
    // Read temperature sensors
    MAX14921Command(cell_balancing, ANALOG_BUFFERED_T1);
    auto t1 = ReadTH();
    MAX14921Command(cell_balancing, ANALOG_BUFFERED_T2);
    auto t2 = ReadTH();

    // Spread the two internal temperature sensor values across all 16 cells (even though some may not be connected)
    // Odd cells are on the left of the balance board, near TH1/T1, even on right side TH2/T2
    for (size_t i = 0; i < 16; i += 2)
    {
      cd.at(i).setInternalTemperature(t1);
      cd.at(i + 1).setInternalTemperature(t2);
    }
  }

  MAX14921Command(cell_balancing, ANALOG_BUFFERED_T3);
  auto t3 = ReadTH();

  // Cell 0 internal temperature is the on-board (PCB) sensor (marked TH6)
  cd.at(0).setInternalTemperature(t3);

  if (!PP.BalanceBoardInstalled)
  {
    // Populate all cells with an internal temperature to prevent controller error messages
    for (size_t i = 0; i < 16; i += 2)
    {
      cd.at(i).setInternalTemperature(t3);
      cd.at(i + 1).setInternalTemperature(t3);
    }
  }
}

[[noreturn]] void ErrorFlashes(int number)
{
  NotificationLedOff();
  delay(500);
  while (true)
  {
    for (size_t i = 0; i < number; i++)
    {
      NotificationLedOn();
      delay(220);
      NotificationLedOff();
      delay(220);
    }

    delay(2000);
  }
}

/// @brief Calculate bit pattern for cell passive balancing (MOSFET switches)
/// @param cd
/// @param num_cells
/// @return bit pattern
uint16_t CalculateCellBalanceRequirement(CellData &cd, uint8_t num_cells)
{
  // if balance daughter board is not installed, always return zero - no balance
  if (PP.BalanceBoardInstalled == false)
  {
    return 0;
  }

  uint16_t reply = 0;

  for (auto i = 0; i < num_cells; i++)
  {
    // Get reference to cell object
    Cell &cell = cd.at(i);

    if (cell.BypassCheck() == true)
    {
      // Our cell voltage is OVER the voltage setpoint limit, start draining cell using bypass resistor
      if (!cell.IsBypassActive())
      {
        // We have just entered the bypass
        cell.StartBypass();
      }

      // Enable balancing bit pattern - this enables the MOSFET and balance resistor
      reply = reply | (uint16_t)(1U << (15 - i));
    }
    else
    {
      if (cell.IsBypassActive())
      {
        // We've just ended bypass....
        cell.StopBypass();
      }
    }
  }
  return reply;
}

/// @brief Calculate various functions against cell voltages
/// @param cd Cell data
/// @param num_cells number of active cells
/// @param lowestmV (reference) Lowest cell voltage (millivolt)
/// @param highestmV (reference) Highest cell voltage (millivolt)
/// @param range (reference) Range between highest and lowest cell voltages (millivolt)
/// @param highest_index Cell index with the highest voltage
/// @param total Total voltage of all cells (millivolt)
void CalculateCellVoltageMinMaxAvg(CellData &cd,
                                   uint8_t num_cells,
                                   uint16_t &lowestmV,
                                   uint16_t &highestmV,
                                   uint16_t &range,
                                   uint8_t &highest_index,
                                   uint32_t &total)
{
  lowestmV = 0xFFFF;
  highestmV = 0;
  // Index of cell with highest voltage
  highest_index = -1;
  total = 0;

  // Determine highest/lowest cell and average voltage
  for (uint8_t i = 0; i < num_cells; i++)
  {
    // Get reference to cell object
    const Cell &cell = cd.at(i);
    auto v = cell.getCellVoltage();
    total += v;
    if (v < lowestmV)
    {
      lowestmV = v;
    }
    if (v > highestmV)
    {
      highestmV = v;
      highest_index = i;
    }
  }

  // Determine voltage differential/range (highest - lowest)
  range = highestmV - lowestmV;
}

int16_t lastRunAwayCellIndex = -1;

/// @brief Determine what (if any) cells need balancing, also controls relay output
/// @param highestTemp Highest temperature of on-board sensors (balance temperature)
/// @return bit pattern for which MOSFETs need enabling
uint16_t DoCellBalancing(const int16_t highestTemp)
{
  uint16_t lowestmV;
  uint16_t highestmV;
  uint8_t highest_index;
  uint16_t range;
  uint32_t total;

  CalculateCellVoltageMinMaxAvg(celldata, number_of_active_cells, lowestmV, highestmV, range, highest_index, total);

  // Switch relay off
  if (HAL_GetTick() > relay_timer)
  {
    relay_timer = 0;
    digitalWrite(RELAY, LOW);
  }

  // Enable external relay outputs, if both range and minimum voltage have been met
  // Setup a timer, to enable this output for a minimum of 1 minute over-run after balance condition is no longer met
  if (range > Cell::getRelayRange() && highestmV > Cell::getRelayMinmV())
  {
    digitalWrite(RELAY, HIGH);
    // This might run into problems if the HAL_GetTick wraps around - approx. every 50 days
    relay_timer = HAL_GetTick() + 60000;
  }

