stuartpittaway/diyBMSv4ESP32/STM32All-In-One/src/main.cpp
  // Daughter board not installed - stop here, no balancing possible (or fan control)
  if (!PP.BalanceBoardInstalled)
  {
    return 0;
  }

  // Now check the temperatures to ensure we remain safe
  if (highestTemp > Cell::getBypassTemperatureSetPoint() || highestTemp > Cell::getSafetyTemperatureCutoff())
  {
    // Temperature is over limit (or safety limit)
    Cell::setOverTemperature(true);
    // Disable all MOSFETs, allow to cool
    return 0;
  }

  if (Cell::getOverTemperature() == true)
  {
    // We went over temperature, so disable balancing until temperature drops below Hysteresis value
    if (highestTemp > Cell::getBypassTemperatureHysteresis())
    {
      // Still too hot - Disable all MOSFETs, allow to cool
      return 0;
    }
    else
    {
      // Temperature dropped below limit, so return to normal, allow balancing
      Cell::setOverTemperature(false);
    }
  }

  // Start with everything switched off
  uint16_t cb = 0;

  // Calculate the average of all the cells
  auto averagemv = (uint16_t)(total / number_of_active_cells);

  // Calculate the differential between highest cell voltage and the average
  uint16_t highest_average_diff = highestmV - averagemv;

  // Should any cells require balancing - check if they have gone over the threshold
  cb = CalculateCellBalanceRequirement(celldata, number_of_active_cells);

  // Now determine if we should balance the highest "run away" cell - only if "normal" balancing is not active
  // If the highest cell is above average cell voltage by X millivolts, then begin balancing until it no longer is.
  // Also ensure the cell voltage is above a minimum - LIFEPO4 cells need to be over 3400mV for this function to be useful.
  if (cb == 0 && highestmV > PP.getRunAwayCellMinimumVoltage() && highest_average_diff > PP.getRunAwayCellDifferential())
  {
    cb = cb | (uint16_t)(1U << (15 - highest_index));

    if (celldata.at(highest_index).IsBypassActive() == false)
    {
      celldata.at(highest_index).StartBypass();
      lastRunAwayCellIndex = highest_index;
    }
  }
  else
  {
    // Stop run away cell balancing, if it was active.
    if (lastRunAwayCellIndex >= 0)
    {
      if (celldata.at(lastRunAwayCellIndex).IsBypassActive())
      {
        celldata.at(lastRunAwayCellIndex).StopBypass();
      }
      lastRunAwayCellIndex = -1;
    }
  }

  return cb;
}

// Checks the serial port for about 60ms and processes any requests
// auto checks for serial baud rate scanning
void ServiceSerialPort()
{
  // Service the serial port/queue
  for (size_t i = 0; i < 60; i++)
  {
    // Call update to receive, decode and process incoming packets.
    myPacketSerial.checkInputStream();

    // Allow data to be received in buffer (delay must be AFTER) checkInputStream
    delay(1);
  }

  if (serialBaudScanning)
  {
    NotificationLedOff();
    serialBaudCountDown--;

    if (PP.getPacketReceivedCounter() > 0)
    {
      // We have found our baud rate - and processed at least 1 packet successfully, so stop scanning
      serialBaudScanning = false;
    }
    else if (serialBaudCountDown <= 0)
    {
      // If we got this far, we have not yet found/received a valid packet of serial data, so try another baud rate
      serialBaudCountDown = 15;
      serialBaudIndex++;

      if (serialBaudIndex >= SerialBaudRates.size())
      {
        serialBaudIndex = 0;
      }

      Serial1.end();
      Serial1.begin(SerialBaudRates.at(serialBaudIndex), SERIAL_8N1);
    }
  }
}

void loop()
{

  // Temperature sensor readings...
  EnableThermistorPower();
  TakeExternalTempMeasurements(celldata);
  DisableThermistorPower();

  if (cell_balancing != 0)
  {
    // Switch off any bypass balancing before taking voltage readings
    MAX14921Command(0, ANALOG_BUFFERED_T1);
    // Allow cell voltages to bounce back
    delay(10);
  }

  digitalWrite(SAMPLE_AFE, HIGH); // Sample cell voltages (all 16 cells at same time)

  if (waitbeforebalance == 0)
  {
    // This also takes about 60ms, but allows request packets to be processed quicker than waiting
    ServiceSerialPort();
  }
  else
  {
    // Delay until we have been through this loop a few times (received a good packet)
    // so we don't return zero voltage readings to controller
    delay(60); // Wait 60ms for capacitors to fill and equalize against cell voltages (1uF caps)
  }

  // delay(60); // Wait 60ms for capacitors to fill and equalize against cell voltages (1uF caps)

  digitalWrite(SAMPLE_AFE, LOW);               // Disable sampling - HOLD mode
  delayMicroseconds(LEVEL_SHIFTING_DELAY_MAX); // Wait to settle

  // Array to hold raw ADC measurements (over sampled)
  std::array<uint32_t, 16> rawADC;
  rawADC.fill(0);
  // Scan active cell voltages (starting at highest cell)
  ADCSampleCellVoltages(number_of_active_cells, rawADC);

  // Once all cells are measured, we enable the sampling to resume...
  // this links the sample capacitors with the cells to equalise the voltages in them
  digitalWrite(SAMPLE_AFE, HIGH);

  // Read T1/T2/T3
  // This also re-enables balancing MOSFET if required....
  EnableThermistorPower();
  TakeOnboardInternalTempMeasurements(celldata);
  DisableThermistorPower();

  // Now process the ADC readings we have taken...
  DecimateRawADCCellVoltage(rawADC, celldata, number_of_active_cells);

  auto highestTemp = max(celldata.at(0).getInternalTemperature(), celldata.at(1).getInternalTemperature());

  // If fan timer has expired, switch off FAN
  // This has the side effect of the fan switching off and on (not physically noticable) should the temperature still be too hot.
  auto millis = HAL_GetTick();
  if (millis > fan_timer)
  {
    fan_timer = 0;
    digitalWrite(FAN, LOW);
  }

  // Enable fan if temperature is OVER Hysteresis value (target minus 5C), or FAN value, and set a 45 second over-run timer
  if (highestTemp > Cell::getBypassTemperatureHysteresis() || highestTemp > Cell::getFanSwitchOnTemperature())
  {
    digitalWrite(FAN, HIGH);
    fan_timer = millis + 45000;
    // Might have problems when HAL_GetTick rolls over - approx. 50days, fan could get stuck on
    // in this case, the fan_timer would have overflowed (unsigned) so would be less than millis.
    if (fan_timer < millis)
    {
      fan_timer = millis;
    }
  }

  // Don't immediately start balance on power up, wait a few cycles to settle
  if (waitbeforebalance == 0)
  {
    cell_balancing = DoCellBalancing(highestTemp);
    MAX14921Command(cell_balancing, ANALOG_BUFFERED_T1);
  }
  else
  {
    waitbeforebalance--;
  }

  // This needs to be below all other cell checking code
  ServiceSerialPort();

  // Every so often, we should call this to calibrate the op-amp as it changes in ambient temperature (takes 8ms to complete)
  if (PP.getPacketReceivedCounter() % 8192 == 0)
  {
    BufferAmplifierOffsetCalibration();
  }

  if (serialBaudScanning)
  {
    NotificationLedOn();
  }

  // Sleep for 800ms
  // TODO:ideally, this would be a true CPU sleep with RTC + UART wake up
  uint16_t countdown = 400;
  while (Serial1.available() == 0 && countdown > 0)
  {
    delay(2);
    countdown--;
  }
}
